loadtesting/test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 5
      arrivalRate: 1
    - duration: 30
      arrivalRate: 10
scenarios:
  - flow:
      - post:
          url: "/login"
          json:
            email: "omkar.borade@gmail.com"
            password: "Omkar123"
          capture:
            json: "$.Token"
            as: "token"
      - get:
          url: "/admin/fetchMapping"
          headers:
            token: "{{token}}"